kModifyObjectsAssocEvaluationMode
The standard action evaluation mode in which the objects the action
depends-on via write-dependencies are modified so that they satisfy
the requirements imposed on them by the action.
If this cannot be achieved, the action needs to report an error and
set its status to kFailedToEvaluateAssocStatus or possibly to
kErasedAssocStatus (if it wants itself to be erased.)